GigaDevice-Semiconductor/Azure_RTOS_Gigadevice/Azure_RTOS_6.1_gd32f450z_eval/iar/common_hardware_code/nx_driver_gd32f450zk.c
NX_PACKET           *packet_ptr;
UINT                i;
       
    /* Default to successful return.  */
    driver_req_ptr -> nx_ip_driver_status =  NX_SUCCESS;

    /* Setup indices.  */
    nx_driver_information.nx_driver_information_receive_current_index = 0; 
    nx_driver_information.nx_driver_information_transmit_current_index = 0; 
    nx_driver_information.nx_driver_information_transmit_release_index = 0;

    /* Clear the number of buffers in use counter.  */
    nx_driver_information.nx_driver_information_number_of_transmit_buffers_in_use = 0;
  
    /* Make sure there are receive packets... otherwise, return an error.  */
    if (nx_driver_information.nx_driver_information_packet_pool_ptr == NULL)
    {
    
        /* There must be receive packets. If not, return an error!  */
        return(NX_DRIVER_ERROR);
    }

    enet_system_setup();

    /* initialize MAC address in ethernet MAC */
    enet_mac_address_set(ENET_MAC_ADDRESS0, _nx_driver_hardware_address);
   
    /* Initialize TX Descriptors list: Ring Mode.  */
    /* Make sure Number of Buffer Descriptors is power of 2 */
#if (NX_DRIVER_TX_DESCRIPTORS & (NX_DRIVER_TX_DESCRIPTORS - 1)) != 0
#error "Number of Buffer Descriptors must be power of 2"
#endif
    
    nx_driver_information.nx_driver_information_dma_tx_descriptors = (enet_descriptors_struct*)(((UINT)nx_driver_information.nx_driver_information_dma_tx_descriptors_area + 15) & (~15));
   
    /* Fill each DMATxDesc descriptor with the right values.  */   
    for(i = 0; i < NX_DRIVER_TX_DESCRIPTORS; i++)
    {

        /* Initialize tx descriptors.  */
        nx_driver_information.nx_driver_information_dma_tx_descriptors[i].status = 0;
        nx_driver_information.nx_driver_information_dma_tx_descriptors[i].control_buffer_size = 0;
        nx_driver_information.nx_driver_information_transmit_packets[i] = NX_NULL;
        nx_driver_information.nx_driver_information_dma_tx_descriptors[i].status |= ENET_TDES0_INTC;

#ifdef GD_CHECKSUM_OFFLOAD
    /* enable the TCP, UDP and ICMP checksum insertion for the Tx frames */
        nx_driver_information.nx_driver_information_dma_tx_descriptors[i].status &= ~ENET_TDES0_CM;
        nx_driver_information.nx_driver_information_dma_tx_descriptors[i].status |= ENET_CHECKSUM_TCPUDPICMP_FULL;
#endif /* GD_CHECKSUM_OFFLOAD */

    }

    /* Put the Wrap indicaiton on the last descriptor.  */
    nx_driver_information.nx_driver_information_dma_tx_descriptors[NX_DRIVER_TX_DESCRIPTORS - 1].status |= ENET_TDES0_TERM;
    /* Set Transmit Descriptor List Address Register */
    ENET_DMA_TDTADDR = (ULONG) nx_driver_information.nx_driver_information_dma_tx_descriptors;



    /* Initialize RX Descriptors list: Ring Mode  */
    /* Make sure Number of Buffer Descriptors is power of 2 */
#if (NX_DRIVER_RX_DESCRIPTORS & (NX_DRIVER_RX_DESCRIPTORS - 1)) != 0
#error "Number of Buffer Descriptors must be power of 2"
#endif
    
    nx_driver_information.nx_driver_information_dma_rx_descriptors = (enet_descriptors_struct*)(((UINT)nx_driver_information.nx_driver_information_dma_rx_descriptors_area + 15) & (~15));
    
    /* Fill each DMARxDesc descriptor with the right values */  
    for(i = 0; i < NX_DRIVER_RX_DESCRIPTORS; i++)
    {

        /* Allocate a packet for the receive buffers.  */
        if (nx_packet_allocate(nx_driver_information.nx_driver_information_packet_pool_ptr, &packet_ptr, 
                               NX_RECEIVE_PACKET, NX_NO_WAIT) == NX_SUCCESS)
        {

            nx_driver_information.nx_driver_information_dma_rx_descriptors[i].status = ENET_RDES0_DAV;

            /* Adjust the packet. After remove enet frame, make sure the IP packet that transfered to the net 4byte alignment*/
            packet_ptr -> nx_packet_prepend_ptr += 2;

            nx_driver_information.nx_driver_information_dma_rx_descriptors[i].buffer1_addr = (ULONG)packet_ptr->nx_packet_prepend_ptr;
            nx_driver_information.nx_driver_information_receive_packets[i] = packet_ptr;
            nx_driver_information.nx_driver_information_rx_buffer_size = packet_ptr -> nx_packet_data_end - packet_ptr -> nx_packet_data_start;
            nx_driver_information.nx_driver_information_dma_rx_descriptors[i].control_buffer_size = nx_driver_information.nx_driver_information_rx_buffer_size;

        }
        else
        {

            /* Cannot allocate packets from the packet pool. */
            return(NX_DRIVER_ERROR);
        }

    }
    
    /* Put the Wrap indicaiton on the last descriptor.  */

    /* Save the size of one rx buffer.  */
    nx_driver_information.nx_driver_information_rx_buffer_size = packet_ptr -> nx_packet_data_end - packet_ptr -> nx_packet_data_start;
        
    /* Configure the Receive Buffer Size Register.  */
    nx_driver_information.nx_driver_information_dma_rx_descriptors[NX_DRIVER_RX_DESCRIPTORS - 1].control_buffer_size = nx_driver_information.nx_driver_information_rx_buffer_size;
    nx_driver_information.nx_driver_information_dma_rx_descriptors[NX_DRIVER_RX_DESCRIPTORS - 1].control_buffer_size |= ENET_RDES1_RERM;

    /* Set Receive Descriptor List Address Register.  */
    ENET_DMA_RDTADDR = (ULONG) nx_driver_information.nx_driver_information_dma_rx_descriptors;

    for (i = 64; i; i--)
    {
        
        nx_driver_information.nx_driver_information_multicast_count[i] = 0;
    }
    
    /* Return success!  */
    return(NX_SUCCESS);
} 


/**************************************************************************/ 
/*                                                                        */ 
/*  FUNCTION                                               RELEASE        */ 
/*                                                                        */ 
/*    _nx_driver_hardware_enable                          PORTABLE C      */ 
/*                                                           5.0          */ 
/*  AUTHOR                                                                */ 
/*                                                                        */ 
/*    Yuxin Zhou, Microsoft Corporation                                   */ 
/*                                                                        */ 
/*  DESCRIPTION                                                           */ 
/*                                                                        */ 
/*    This function processes hardware-specific link enable requests.     */ 
/*                                                                        */ 
/*  INPUT                                                                 */ 
/*                                                                        */ 
/*    driver_req_ptr                        Driver request pointer        */
/*                                                                        */ 
/*  OUTPUT                                                                */ 
/*                                                                        */ 
/*    status                                [NX_SUCCESS|NX_DRIVER_ERROR]  */
/*                                                                        */ 
/*  CALLS                                                                 */ 
/*                                                                        */ 

