GigaDevice-Semiconductor/Azure_RTOS_Gigadevice/Azure_RTOS_6.1_gd32f450z_eval/iar/common_hardware_code/nx_driver_gd32f450zk.c
            bd_count = 0;

        }
        else
        {
            
            /* This BD is not the last BD of a frame. It is a intermediate descriptor.  */
            
            nx_driver_information.nx_driver_information_receive_packets[idx] -> nx_packet_next = nx_driver_information.nx_driver_information_receive_packets[(idx + 1) & (NX_DRIVER_RX_DESCRIPTORS - 1)];
            
            nx_driver_information.nx_driver_information_receive_packets[idx] -> nx_packet_append_ptr = nx_driver_information.nx_driver_information_receive_packets[idx] -> nx_packet_data_end;
 
            bd_count++;
        }
    }

    /* check Rx buffer unavailable flag status */
    if ((uint32_t)RESET != (ENET_DMA_STAT & ENET_DMA_STAT_RBU)){
        /* clear RBU flag */
        ENET_DMA_STAT = ENET_DMA_STAT_RBU;
        /* resume DMA reception by writing to the RPEN register*/
        ENET_DMA_RPEN = 0U;
    }

}

/**************************************************************************/ 
/*                                                                        */ 
/*  FUNCTION                                               RELEASE        */ 
/*                                                                        */ 
/*    nx_driver_link_mode_changed                         PORTABLE C      */ 
/*                                                           5.0          */ 
/*  AUTHOR                                                                */ 
/*                                                                        */ 
/*    Yuxin Zhou, Microsoft Corporation                                   */ 
/*                                                                        */ 
/*  DESCRIPTION                                                           */ 
/*                                                                        */ 
/*    This function changes the link mode of the Ethernet.                */
/*                                                                        */ 
/*  INPUT                                                                 */ 
/*                                                                        */ 
/*    None                                                                */
/*                                                                        */ 
/*  OUTPUT                                                                */ 
/*                                                                        */ 
/*    None                                                                */
/*                                                                        */ 
/*  CALLS                                                                 */ 
/*                                                                        */ 
/*    enet_duplex                           Set duplex mode               */ 
/*    nx_packet_transmit_release            Release the packet            */ 
/*                                                                        */
/*  CALLED BY                                                             */ 
/*                                                                        */ 
/*    nx_driver_ethernet_phy_isr                                          */ 
/*                                                                        */ 
/*  RELEASE HISTORY                                                       */ 
/*                                                                        */ 
/*    DATE              NAME                      DESCRIPTION             */ 
/*                                                                        */ 
/*  02-01-2018     Yuxin Zhou               Initial Version 5.0           */ 
/*                                                                        */ 
/**************************************************************************/ 
VOID  nx_driver_link_mode_changed(VOID)
{

ULONG numOfBuf;
ULONG idx;


    /* Stop the Ethernet.  */
    enet_disable();
    
    /* Set speed for RMII mode.  */
    if (nx_driver_information.nx_driver_information_link_speed == PHY_SPEED_STATUS)
    {
        
        ENET_MAC_CFG &= ~ENET_MAC_CFG_SPD;
    }
    else
    {
        
        ENET_MAC_CFG |= ENET_MAC_CFG_SPD;
    }
    
    /* Set duplex mode.  */
    /* Set the duplex on the selected FEC controller*/
    if (nx_driver_information.nx_driver_information_link_duplex == PHY_DUPLEX_STATUS)
    {

        ENET_MAC_CFG &= ~ENET_MAC_CFG_DPM;
    }
    else
    {

        ENET_MAC_CFG |= ENET_MAC_CFG_DPM;
    }
    
    if (nx_driver_information.nx_driver_information_state >= NX_DRIVER_STATE_INITIALIZED)
    {
        
        numOfBuf = nx_driver_information.nx_driver_information_number_of_transmit_buffers_in_use;
        idx =      nx_driver_information.nx_driver_information_transmit_release_index;

        /* Reset indices.  */
        nx_driver_information.nx_driver_information_receive_current_index = 0; 
        nx_driver_information.nx_driver_information_transmit_current_index = 0; 
        nx_driver_information.nx_driver_information_transmit_release_index = 0;
        nx_driver_information.nx_driver_information_number_of_transmit_buffers_in_use = 0;
        
        /* Release transmit packets if any.  */
        while (numOfBuf--)
        {
            
            /* If no packet, just examine the next packet.  */
            if (nx_driver_information.nx_driver_information_transmit_packets[idx] == NX_NULL) 
            {
            
                /* No packet in use, skip to next.  */
                idx = (idx + 1) & (NX_DRIVER_TX_DESCRIPTORS - 1);
                continue;
            }           
            
            /* Remove the Ethernet header and release the packet.  */
            NX_DRIVER_ETHERNET_HEADER_REMOVE(nx_driver_information.nx_driver_information_transmit_packets[idx]);

            /* Release the packet.  */
            nx_packet_transmit_release(nx_driver_information.nx_driver_information_transmit_packets[idx]);
        }
        
        /* Free receive descriptors.  */
        for (idx = 0; idx < NX_DRIVER_RX_DESCRIPTORS; idx++)
        {
            
            nx_driver_information.nx_driver_information_dma_rx_descriptors[idx].status |= ENET_RDES0_LDES;
        }
    }
    
    /* Set Transmit Descriptor List Address Register */
    ENET_DMA_TDTADDR = (ULONG) nx_driver_information.nx_driver_information_dma_tx_descriptors;
    
